# SetStartEndPercentages Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewDisplayDepthCueing..::..SetStartEndPercentages Method
ViewDisplayDepthCueing Class See Also
---
Sets start and end percentages.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void SetStartEndPercentages(
	int startPercentage,
	int endPercentage
)
```

Visual Basic
---
```text
Public Sub SetStartEndPercentages ( _
	startPercentage As Integer, _
	endPercentage As Integer _
)
```

Visual C++
---
```text
public:
void SetStartEndPercentages(
	int startPercentage,
	int endPercentage
)
```

# ### Parameters
startPercentage
    Type: System..::..Int32 The start percentage defines where depth cueing starts.
endPercentage
    Type: System..::..Int32 The end percentage defines where depth cueing ends.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The start and end percentages values are not valid. The valid range is 0 to 100 and start is smaller than end. |

# See Also
ViewDisplayDepthCueing Class
Autodesk.Revit.DB Namespace